app/views/dashboard/admin/items/edit.html.erb

SELECT `cates`.* FROM `cates`
---
  圖片： <%= f.file_field :cover %><br>
  類別： <%= f.select :cate_id, Cate.all.map{|c|[c.name, c.id]} %>