app/controllers/dashboard/admin/items_controller.rb

  def index
    @items = @paginate = Item.order('id DESC').includes(:cate).paginate(:page => params[:page])
---
SELECT "items".* FROM "items" ORDER BY id DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM `items`
SELECT `cates`.* FROM `cates` WHERE `cates`.`id` IN (3, 2)

  def edit
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "cover_file_name" = $2, "cover_file_size" = $3, "cover_updated_at" = $4, "updated_at" = $5 WHERE "items"."id" = $6  [["name", "AEROSMITH"], ["cover_file_name", "album1.jpg"], ["cover_file_size", 56135], ["cover_updated_at", "2020-10-18 03:34:49.462842"], ["updated_at", "2020-10-18 03:34:49.604464"], ["id", 1]]